{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c1795197-e14d-4b37-8b39-a2ab81b3b60b",
   "metadata": {},
   "source": [
    "## индивидуальная задача 3 (вариант 1)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "556c19fb-38aa-4242-a65e-fe2b1d83bdb7",
   "metadata": {},
   "source": [
    "Банк разрабатывает новый тип банковских карт с идентификацией клиента. Каждая карта имеет кодовое число X, из которого можно получить номер счета клиента, стирая некоторые цифры.\n",
    "\n",
    "Необходимо определить минимальный номер  счета N, который нельзя получить из цифр X указанным способом. Например, при X = 12013456789 номера счетов 5, 12, 17 или 12013456789 получить можно, а номера 22 или 71 получить нельзя.\n",
    "\n",
    "Напишите программу, которая найдет значение N по заданному X.\n",
    "На вход программе подается натуральное число X без ведущих нулей. Выведите искомое значение N без ведущих нулей."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e44a618-3ee6-4733-aa9b-c5b161cf72ab",
   "metadata": {},
   "source": [
    "Ввод\n",
    "179 \n",
    "Вывод\n",
    "2\n",
    "\n",
    "Ввод\n",
    "12013456789 \n",
    "Вывод\n",
    "22"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "57fa61a5-3777-4964-8b0f-b1938897e9df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " 12013456789\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "22\n"
     ]
    }
   ],
   "source": [
    "import re\n",
    "X = input()\n",
    "N = 1\n",
    "while True:\n",
    "    match = re.search('.*'.join(d for d in str(N)), X)\n",
    "    if match:\n",
    "        N = N + 1\n",
    "    else:\n",
    "        break\n",
    "print(N)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
