{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "5c99a669-bfe6-4332-abd2-9a5b97bebc31",
   "metadata": {},
   "source": [
    "## индивидуальная задача 2 (вариант 9)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3cd583b1-f00c-468c-a36e-5122061ecb0e",
   "metadata": {},
   "source": [
    "Дано генеалогическое древо, определите высоту всех его элементов. Каждом элементу дерева сопоставляется целое неотрицательное число, называемое высотой. У родоначальника высота равна 0, у любого другого элемента высота на 1 больше, чем у его родителя.\n",
    "\n",
    "Программа получает на вход число элементов в генеалогическом древе N. Далее следует N строк, задающие родителя для каждого элемента древа, кроме родоначальника. Каждая строка имеет вид имя_потомка имя_родителя.\n",
    "Программа должна вывести список всех элементов древа в лексикографическом порядке. После вывода имени каждого элемента необходимо вывести его высоту.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "5e5fdd4f-74d8-40a5-99a5-067fa3cca092",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Артем, 2\n",
      "Богдан, 3\n",
      "Василий, 0\n",
      "Георгий, 3\n",
      "Елена, 1\n",
      "Елизавета, 1\n",
      "Карина, 2\n",
      "Светлана, 1\n",
      "Юлия, 2\n",
      "Ян, 3\n"
     ]
    }
   ],
   "source": [
    "with open('text_ind2.txt', 'r', encoding='utf-8') as f:\n",
    "    lines = f.readlines()\n",
    "    N = int(lines[0])\n",
    "    persons_highs = {}\n",
    "    for i in range(1, N+1):\n",
    "        child_parent = lines[i].split()\n",
    "        if len(child_parent) == 1:\n",
    "            oldest = child_parent[0]\n",
    "            persons_highs[oldest] = 0\n",
    "        else:\n",
    "            child, parent = child_parent[0], child_parent[1]\n",
    "            persons_highs[child] = persons_highs.get(parent, 0) + 1\n",
    "f.close()\n",
    "sorted_map = sorted(persons_highs)\n",
    "for i in range(N):\n",
    "    print(sorted_map[i] + \", \" + str(persons_highs.get(sorted_map[i])))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f80551b9-4774-4901-b46e-63eba047706a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6afff41d-6ca2-4636-86ab-c37388bacdab",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
